app/views/chat/index.html.erb


		<% if (@msgs.length > 0) %>
		<%   @msgs.each do |row| %>
		<%=    "span = document.createElement('span')" %>
		<%=     "console.log('#{row.user_id}')" %>
		<%=    "span.innerHTML = '<b>#{User.find(row.user_id).id}: </b>#{row.message}<br />'"  %>
		<%=    "document.getElementById('chatdiv').appendChild(span)" %>
		<%   end %>
		<%  end  %>
	})
---
INSERT INTO `users` (`created_at`, `ip`, `password`, `updated_at`, `username`) VALUES ('2012-07-29 03:10:37', '127.0.0.1', NULL, '2012-07-29 03:10:37', NULL)
SELECT `users`.* FROM `users` WHERE `users`.`message_id` = 1 LIMIT 1