app/controllers/chat_controller.rb

  def index
    ip = request.remote_ip
    usr = User.where("ip = ?", ip)
    if (usr.length > 0)
      session[:usrid] = usr.first.id
      session[:username] = usr.first.username
    else
      usr = User.new
      usr.ip = ip
      usr.username = "Guest"
      usr.save
      usr = User.where("ip = ?", ip)
      session[:usrid] = usr.first.id
    end
    session[:roomid] = 1
    @msgs = Message.where("room_id = ?", session[:roomid]).order("id DESC").limit(10).reverse
---
SELECT `users`.* FROM `users` WHERE (ip = '127.0.0.1') LIMIT 1
INSERT INTO `users` (`created_at`, `ip`, `password`, `updated_at`, `username`) VALUES ('2012-07-29 03:10:37', '127.0.0.1', NULL, '2012-07-29 03:10:37', NULL)
SELECT `messages`.* FROM `messages` WHERE (room_id = 0) ORDER BY id DESC LIMIT 10

  def new_message
    if (params[:message] && params[:message] != "")
      msg = Message.new
      msg.message = params[:message]
      msg.user_id = session[:usrid]
      msg.room_id = session[:roomid]
      msg.save

      if (params[:username] != session[:username])
        usr = User.find(session[:usrid])
        usr.username = params[:username]
        usr.save
---
INSERT INTO `messages` (`created_at`, `message`, `room_id`, `updated_at`, `user_id`) VALUES ('2012-07-29 03:11:46', 'test user', NULL, '2012-07-29 03:11:46', 1)
SELECT `users`.* FROM `users` WHERE `users`.`id` = -1 LIMIT 1
UPDATE `users` SET `username` = 'Guest', `updated_at` = '2012-07-29 16:47:52' WHERE `users`.`id` = 1

  def change_room
    if (params[:room])
      room = Room.where("name = ?", params[:room])
      if (room.length > 0)
        session[:roomid] = room.first.id
        msgs = Message.where("room_id = ?", session[:roomid]).order("id DESC").limit(10).reverse
        rows = []
        i = 0
        puts "LENGTH: #{msgs.length}"
        msgs.each do |record|
          rows[i] = [User.where("id = ?", record.user_id).first.username, record.message, record.created_at]
---
SELECT `rooms`.* FROM `rooms` WHERE (name = 'Complex')
SELECT `messages`.* FROM `messages` WHERE (room_id = 2) ORDER BY id DESC LIMIT 10
SELECT `users`.* FROM `users` WHERE (id = 1) LIMIT 1